{"meta":{"title":"The blog of Blur","subtitle":"Hearing the fall of snow.","description":"Personal blog of blur.","author":"Blur - Shenghui Xu","url":"http://example.com","root":"/"},"pages":[{"title":"About Me","date":"2022-04-16T17:45:16.000Z","updated":"2022-04-16T21:04:08.505Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"Who am i This is Shenghui Xu and welcome to my blog. I am currently a year-one MS student with the Electrical Computer Engineering department of University of California, Los Angeles. I am now focusing on the track of Signals &amp; Systems and have a GPA of 4.0. I am also an incoming applied researcher intern at ebay. Before I went to UCLA, I was an undergraduate student majored in Computer Science with Soochow University. I graduated with honor in Sep. 2016 (with a GPA of 3.83). Skills and Tools Languages Python &#x2F; Matlab &#x2F; R &#x2F; Java &#x2F; JavaScript &#x2F; C++ Bash &#x2F; CMD &#x2F; Code Climate Frameworks TensorFlow &#x2F; Torch &#x2F; Keras &#x2F; Theano &#x2F; CUDA &#x2F; CUDNN Scikit-learn &#x2F; nltk &#x2F; Numpy &#x2F; Spark (PySpark) Qt Web HTML&#x2F;HTML5 &#x2F; CSS &#x2F; Node.js jQuery &#x2F; Vue.js &#x2F; quasar Tornado &#x2F; Chrome Dev Tools Editor &amp; IDE VIM &#x2F; Sublime Text &#x2F; Notepad++ &#x2F; Lime Text Visual Studio &#x2F; Qtcreator &#x2F; Pycharm &#x2F; Eclipse Version Control &amp; Deployment Git &#x2F; SVN &#x2F; Github &#x2F; GitLab &#x2F; Gitee &#x2F; Anaconda &#x2F; npm Testing Jenkins &#x2F; Lint &#x2F; Pytest &#x2F; Docker &#x2F; Unit Testing Data Management MySQL &#x2F; MongoDB &#x2F; Redis &#x2F; Memcached Projects Experiences"}],"posts":[{"title":"SQL-Study-Note-7 - Transactions","slug":"SQL-Study-Note-7","date":"2022-04-17T05:07:50.000Z","updated":"2022-04-17T05:43:36.417Z","comments":true,"path":"2022/04/16/SQL-Study-Note-7/","link":"","permalink":"http://example.com/2022/04/16/SQL-Study-Note-7/","excerpt":"Transactions Principles of Transaction (ACID) Atomicity Consistency Isolation Durability","text":"Transactions Principles of Transaction (ACID) Atomicity Consistency Isolation Durability 12345START TRANSACTION;// Instruction block to be executed-- If only part of the transaction is done and the connection to server is lost, the finished part would be rolled backCOMMIT; A transaction would lock the lines and tables to be updated so that they are untouchable to other transactions.If one transaction comes into locked resources, it would wait the owner of the lock to finish, or until it expires the time limit itself.At the same time, ROLLBACK is also a SQL instruction and keyword. Different level of transaction isolation: 12SET TRANSACTION ISOLATION LEVEL SERIALIZABLE;-- Note that this setting is session-leveled. It comes with the tradeoff that the higher the isolation level is, the lower performance it reaches. (In extreme situation, serializable level would not benefit from distributed architecture.) Read Uncommitted: May read uncommited data (dirty read). Rarely used in actual application as the performance improvement is very limited. Read Committed: Default level for most DBMS (Oracle, SQL server). However, it may counter Nonrepeatable Read: same select may have different result within one transaction. This is due to the UPDATE operation made by other transactions and can be solved by Line Level Lock. Repeatable Read: Applied with Line Level Lock. However, it can still encounter Phantom Reads (caused by the delete &#x2F; insert operations made by other transactions). Require Table Level Lock to solve. Serializable: Ban the parallel processing and sort all the transactions.","categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]},{"title":"SQL-Study-Note-6 - Trigger and Events","slug":"SQL-Study-Note-6","date":"2022-04-17T04:46:07.000Z","updated":"2022-04-17T05:05:21.886Z","comments":true,"path":"2022/04/16/SQL-Study-Note-6/","link":"","permalink":"http://example.com/2022/04/16/SQL-Study-Note-6/","excerpt":"TriggerTriggers are the code blocks executed automatically before insertion &#x2F; update &#x2F; delete take effect.","text":"TriggerTriggers are the code blocks executed automatically before insertion &#x2F; update &#x2F; delete take effect. 123456789DELIMITER $$CREATE TRIGGER payments_after_insert AFTER/BEFORE INSERT/UPDATE/DELETE ON payments FOR EACH ROWBEGIN -- You can either write SQL codes here or call the existing procedure...END $$DELIMITER ; Extensive syntax123NEW -- Return the just inserted line.OLD -- Return the just deleted line.NEW.amount -- Can use . to specify a column These two (NEW &#x2F; OLD) are keywords of MySQL.Triggers can be used to modify data of any table EXCEPT the table which is being listened by the trigger. This is because trigger can trigger itself and results in infinite loop. 12SHOW TRIGGERS -- Show all the created triggers.ShOW TRIGGERS LIKE &#x27;c%&#x27; -- Filter the triggers. Triggers can be also used for auditing purpose, i.e., record the executor, attribute and timestamp when an operation is done. EVENTEvents are periodically triggered codes for multiple tasks. 12SHOW VARIABLES -- Show all system variables.SET GLOBAL event_scheduler=ON / OFF -- Switch the event_scheduler Create Event: 12345678DELIMITER $$CREATE EVENT yearly_delete_state_audit_rows ON SCHEDULEEVERY 1 YEAR STARTS ‘2020-01-01’ ENDS ’2029-01-01’DO BEGIN -- Note that DO is required here....END $$DELIMITER ; Two ways to calculate the diff of time: 12NOW() – INTERVAL 1 YEAR;DATESUB(NOW(), INTERVAL 1 YEAR); Activate &#x2F; Deactivate Events: 1ALTER EVENT e_name DISABLE;","categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]},{"title":"SQL-Study-Note-5 - Stored Procedure and User Defined Functions","slug":"SQL-Study-Note-5","date":"2022-04-17T02:01:32.000Z","updated":"2022-04-17T04:48:52.424Z","comments":true,"path":"2022/04/16/SQL-Study-Note-5/","link":"","permalink":"http://example.com/2022/04/16/SQL-Study-Note-5/","excerpt":"Stored ProcedureMotivationGenerally, developers prefer not to interpret string as SQL codes &#x2F; instructions due to security concerns.","text":"Stored ProcedureMotivationGenerally, developers prefer not to interpret string as SQL codes &#x2F; instructions due to security concerns. You can wrap the query and update functionality with Stored Procedure. DBMS is able to further optimize the stored procedure and enhance the security. The stored procedure itself is similar to a function implementation. Syntax Implementation123456DELIMITER $$CREATE PROCEDURE get_clients()BEGIN SELECT * FROM clients;END $$DELIMITER ; The reason of changing DELIMITER is that, we need to use ; to seperate SQL statements within the stored procedure. (We are forced to do so!)This will damage the integrity of our BEGIN-END statement block. Thus, we should temporarily change the DELIMITER (into $$) and change back to ; after the definition of our stored procedure. In order to avoid conflict of naming, MySQL would add a pair of &#96; to the names of databases, tables and columns. 1Student -&gt; `Student` -- Auto-Renamed to avoid conflicts. You can use 1CALL procedure_name() to call the defined stored procedure. If you are using the workbench of MySQL, you can simply right click Store Procedures to create one. In this case you do not need to worry about the delimiter and MySQL would help you with the transformation (Some sort of Syntactic sugar). Delete Stored Procedure1DROP PROCEDURE (IF EXISTS) get_clients; Parameter Setting of Stored Procedure12CREATE PROCEDURE get_clinets ( state CHAR(2) );-- You must specify the size and type of the passed parameter. After setting the parameter declaration, the parameters can be then used in the procedure for program logic building.All the parameters are REQUIRED. However, they can have default values.Even if you want to use the default value, you should pass a NULL to the procedure as a placeholder. 123456IF state IS NULL THEN SET state = ‘CA’; END IF;-- By using such statement, you can realize default value de facto.table.col_name = IFNULL(para, table.col_name);-- This one is more concise and thus recommended.-- If para is NULL, then use the default value. Parameter Verification and Constraints12345IF payment_amount &lt;= 0 THEN SIGNAL SQLSTATE &#x27;22003&#x27; SET MESSAGE_TEXT = ‘Invalid payment amount’;END IF-- payment_amount is required to &gt; 0. If not satisfied, a error code of &#x27;22003&#x27; is raised and the prompting MESSAGE_TEXT is written. SIGNAL is similar to throw exception in other languages. SQLSTATE is the predetermined error code (corresponding to ‘out of range’ here, refer the documentation). Provide Return Value for Stored Procedure1234CREATE PROCEDURE `name` (client_id INT, OUT invoices_count INT)BEGIN SELECT COUNT(*) INTO invoices_count FROM invoices;END This is a syntactic sugar anyway. What MySQL actually does is define two parameters and pass them to the PROCEDURE for updating. Then SELECT the updated parameter.At the same time, MySQL uses a ‘@’ prefix to identify variables. For an example, 1SET @a = 0; User Variable and Local VariableSET is used to assign the User Variable while DECLARE is used to assign the Local Variable used within a stored procedure. 1DECLARE risk_factor DECIMAL(9, 2) DEFAULT 0; You can assign the declared variable with the following code: 1SELECT COUNT(*) INTO risk_factor FROM table; User-Defined FunctionsThe only difference between the procedure and function is that function can only return one single value. 12345678CREATE FUNCTION get_risk_f ( client_id INT) -- Must specify the type for the input parameterRETURNS INTEGER -- The return parameter must have a type too. Function always returns a single value rather than a query result.DETERMINISTIC -- Optional attribute. Always return the same result for the same id.READS SQL DATA -- Optional. This function can read SQLMODIFIES SQL DATA -- Optional. This function can modify table.BEGIN...RETURN 1; Functions can be deleted with DROP keyword as well.","categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]},{"title":"SQL-Study-Note-4 - View","slug":"SQL-Study-Note-4","date":"2022-04-17T01:39:43.000Z","updated":"2022-04-17T02:00:31.084Z","comments":true,"path":"2022/04/16/SQL-Study-Note-4/","link":"","permalink":"http://example.com/2022/04/16/SQL-Study-Note-4/","excerpt":"ViewIntroduction to ViewWith the introduction of View, middle &#x2F; query results can be stored for further query and use, just like a real table.","text":"ViewIntroduction to ViewWith the introduction of View, middle &#x2F; query results can be stored for further query and use, just like a real table. Creation and Manipulation on View Creation of View: 1CREATE VIEW view_name AS (SELECT …) Created Views would NOT be stored with the tables. It would be stored in ‘Views’ instead. Alter &#x2F; Drop of View: 1234DROP VIEW sales_by_client;-- Drop / delete Operation.CREATE / REPLACE VIEW AS ...;-- REPLACE has the advantage against CREATE that it does not require the view to be dropped in advance. Created Views would NOT be stored with the tables. It would be stored in ‘Views’ instead. In fact, the Views should be viewed as stored query code. When you need to use them, you can simply rerun the script to retrieve the result. So you can use version control tools to store and share them. Updatable Views: Updatable Views stand for those Views who DO NOT contain the keywords of DISTINCT &#x2F; aggregate functions &#x2F; GROUP BY &#x2F; HAVING &#x2F; UNION. In this case, these Views can be updated via CREATE &#x2F; REPLACE. Update Opertion: 1UPDATE view_name SET due_date = DATE_ADD(due_date, INTERVAL 2 DAY) WHERE invoice_id = 1l Point of updatable views: If you DO NOT have the authorization to modify a table, you can still create a View based on that table and update the View, as long as it is Updatable. WITH CHECK OPTION: If the UPDATE operation may cause some rows to be deleted, you can add WITH CHECK OPTION to the end of the UPDATE code to prevent this from happening.","categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]},{"title":"SQL Study Note - 3 - Function and the Aggregate Function","slug":"SQL-Study-Note-3","date":"2022-04-17T01:34:31.000Z","updated":"2022-04-17T01:48:08.598Z","comments":true,"path":"2022/04/16/SQL-Study-Note-3/","link":"","permalink":"http://example.com/2022/04/16/SQL-Study-Note-3/","excerpt":"Function and the Aggregate Function","text":"Function and the Aggregate Function Aggregate Function: 1COUNT(), MAX(), MIN(), AVG(), SUM() It should be noted that COUNT(row_name) only returns the number of the non-empty records. If you need to find out the total number of rows, you shoud use COUNT(*). You can use COUNT (DISTINCT client_id) to find out the number of unique client_id, too. Non-Aggregate Function: 1234RAND() -- Generate a random number within (0, 1)RAND(seed) -- Specify the rand seedSQRT() -- Find the square root for each valueCONCAT(a, b) -- Concat two strings into one Non-aggregate function would return a same-lengthed sequence for the input values. These functions are element-wised. GROUP BY clause: Group the rows according to a given column name. Rows with the same value in the very column would be aggregated together. The order of query clause: IMPORTANT: SELECT -&gt; FROM -&gt; WHERE -&gt; ORDER BY Grouping based on multiple attributes: 1GROUP BY state, city In this case, the grouping would based on the tuple: (state, city) Having: 1SELECT SUM(res) AS aggregated_res FROM t GROUP BY state HAVING aggregated_res &gt; 100; You cannot use WHERE clause to filter the result of the aggreate function, because at that time, the query is not yet completed and the aggregate result is not yet calculated. It should be noted that HAVING clause supports the filtering on Composite Condition, e.g. HAVING aggre_res1 &gt; 10 AND aggre_res2 &lt; 10. The HAVING clause is execute after the query is finished. So that it can only filter the selected columns. The columns not selected cannot be used in the filtering constraint. HAVING does NOT support alias. WITH ROLLUP: 1SELECT SUM(res) AS aggregated_res FROM t GROUP BY state HAVING aggregated_res &gt; 100; Conduct an extra aggregate operation for all the aggregated results. E.g., the SUM &#x2F; MEAN of the aggregated results. This is only supported by MySQL. If composite grouping is applied, e.g., GROUP BY col_a, col_b, each group identified by a unique (col_a, col_b) would conduct an extra aggregation. Nesting Sub-query: 12SELECT * FROM (SELECT ...);SELECT * FROM table WHERE col_name IN / NOT IN (SELECT ...); I.E., select from the result of another select operation. ALL VS ANY &#x2F; SOME 1234SELECT * FROM invoices WHERE invoice_total &gt; ALL(SELECT invoice_total FROM invoices WHERE client_id = 3);-- Require the records to be greater than ANY of the sub-query results in order to be selectedSELECT * FROM invoices WHERE invoice_total &gt; ANY / SOME(SELECT invoice_total FROM invoices WHERE client_id = 3);-- Require the records to be greater than ONE of the sub-query results in order to be selected ANY &#x2F; SOME are completely equivalent. If one value of the sub-query satisfies the logical expression, the ‘&gt; ANY’ expression is satisfied. For ALL, only if all the values of the sub-query satisfies the logical expression, the ‘&gt; ALL’ expression can be satisfied. ‘&#x3D; ANY’ also equals to ‘IN’. Correlated sub-query Code-writing Order: SELECT, FROM, WHERE, GROUP BY, HAVING, ORDER BY Executing Order: FROM, WHERE, GROUP BY, HAVING, SELECT, ORDER BY The marked line is crucial, as the logic of correlated subquery would retrive one value from the main query at a time, working in an iterative manner, input the value into the sub-query to ge the result and pass the result back to the main query. The main query would check the constraint of WHERE clause and return the result; This means that different alias are required even they points to the same table. Sub-query can touch the alias of the main &#x2F; outer query. EXISTS 1SELECT * FROM c WHERE EXISTS (SELECT id FROM I WHERE c_id = c.c_id) EXISTS keyword has advantage against the ‘IN (sub-query)’ manner. This is because the ‘IN (sub-query)’ needs to finish the sub-query first before the sub-query can return any result to the outer query. However, EXISTS can work as a short-circuiting operator which stops immediately when the first results is found. Write Sub-query in SELECT &#x2F; FROM clause Use SELECT to duplicate the result of aggregate function1SELECT (SELECT AVG() FROM t) AS average FROM t; This query makes sense because, the aggregate function would only return one single value. If you want to conduct row-wise calculation on the aggregate value, you have to duplicate it. You can also SELECT FROM a sub-query like it is a real-table. However, an alias is required. This may make the query too complicated and should be used with care. Numerical Function123456789ROUND(num, mantissas_n); -- Round the given number, and mantissas_n decimal places are preserved.TRUNCATE(num, mantissas_n); -- Truncate the given number with the decimal setting.--Simiarly, we have:CEILING()FLOOR()ABS()RAND() Other available functions can be found in the MySQL documentation. String Function1234567891011121314151617181920LENGTH(&#x27;sky&#x27;); -- Return the length of the input string.UPPER(&#x27;sky&#x27;);--transform to upper caseLOWER(&#x27;sky&#x27;);--transform to lower caseLTRIM() / RTRIM() / TRIM();-- Remove the left / right / both side of spaces.LEFT(string, n);-- Return the left n chars;RIGHT(string, n);-- Return the right n chars;SUBSTRING(string, start, n);-- Return n chars starts from start.LOCATE(&#x27;n&#x27;, &#x27;kinter&#x27;);-- Find the smallest index where the pattern (&#x27;n&#x27;) occurs in the searched string (&#x27;kinter&#x27;). Index starts from 1.REPLACE(string, source, target);-- Replace all the pattern of source to target, in string.CONCAT(a, b);-- Concat strings into 1. Refer the documentation for more string functions. Time Function1234567891011121314NOW();-- Return the current time and date.CURDATE();-- Return the current date.CURTIME():-- Return the current time.YEAR(time) / MONTH() / DAY() / HOUR() / MINUTE() / SECOND() ...-- Extract the year... of a time / date. DAYNAME(time);-- Return the name of day, like FridayMONTHNAME(time);-- Return sth like DECEMBER...EXTRACT( YEAR FROM NOW() )-- Personalize a date / time.. Year can be substitute with other keywords E.g., extract order of this year: YEAR(date) &#x3D; YEAR(NOW()); Fomat Time &#x2F; Date123456789101112DATE_FORMAT(NOW(), &#x27;%y&#x27;);-- %y for 2-digit year, and %Y for 4-digit year;-- Similar for D/d/M/m, ...-- Can be use to format time as well.SELECT DATE_ADD( NOW(), INTERVAL 1 DAY );-- Return the date of 1 day later. Accept negative value like -1.-- Can Use DATE_SUB instead and the behavior is very similar.DATEDIFF(d_1, d_2);-- Find the diff of two dates. (by days, the input accepts DATE only)-- Result can be negative, calculated by d_1 - d_2.TIME_TO_SEC(time);-- Transform time to second, starts from 12 am. IFNULL &amp; COALESCE123SELECT order_id IFNULL(shipper_id, &#x27;Not Assigned&#x27;) AS s;-- If a shipper_id is NULL, return &#x27;Not Assigned&#x27; instead.COALESCE(shipper_id, comments, ..., &#x27;Not assigned&#x27;); The COALESCE is the generalization of IFNULL. The principle is, by offering a bunch of column_name &#x2F; values, return the first one which IS NOT NULL. IF &#x2F; CASE (Conditional Statement)1234567891011IF (expression, first, second);-- If the expression is TRUE, then return first; else, return second.SELECT order_id CASE WHEN YEAR(order_date) = YEAR(NOW()) THEN ‘Active’ WHEN YEAR(order_date) = YEAR(NOW()) - 1 THEN ‘Last Year’ ELSE ‘Other cases’END AS categoryFROM orders-- The case statement is quite similar with IF statement.","categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]},{"title":"SQL Study Note - 2 - The Update / Delete / Insert Syntax","slug":"SQL-Study-Note-2","date":"2022-04-17T01:29:50.000Z","updated":"2022-04-17T01:48:03.088Z","comments":true,"path":"2022/04/16/SQL-Study-Note-2/","link":"","permalink":"http://example.com/2022/04/16/SQL-Study-Note-2/","excerpt":"The update &#x2F; delete &#x2F; insert syntax","text":"The update &#x2F; delete &#x2F; insert syntax The column attributes of table: PK： primary key NN： Not Null UQ：Unique Index B： binary UN： unsigned data type ZF： zero filled AI： Auto incremental G： Generated column Data Type in MySQL: INT (11): integer with a length of 11 VARCHAR(50): array of char with a size $\\le 50$. CHAR(50): array of char with a size $&#x3D; 50$. DEFAULT: Use the given default value to fill this column. Insert data to table: 1INSERT INTO customers VALUES (DEFAULT, ‘John’, ‘Smith’, ‘1990-01-01’, NULL, ‘address’, ‘city’, ‘CA’, DEFAULT); At the same time, MySQL allows to specify the column names to be assigned values. 1INSERT INTO customers (first_name, …, state, points) VALUES (…); In this case, you do not need to assign the values to the order (of columns) defined by the table. The number of affected rows would be returned after successful insertion. Insert Multi-rows: 1INSERT INTO shippers (name) VALUES (&#x27;S1&#x27;), (&#x27;S2&#x27;), (&#x27;S3&#x27;); LAST_INSERT_ID: Returns the most recently generated Auto Incremental ID. Enable hierarchical data insertion. I.E., find the ID of the latest inserted data, and then use the id to associate &#x2F; update other tables. This syntax feature can eliminate ambiguity, and it is also convenient to correspond a main table record to multiple sub table records. Duplicate Table: 1CREATE TABLE orders_archived AS SELECT * FROM orders; Use the selected partial &#x2F; entire data of other table to create a duplicate. However, column attributes (constraints) like PK, AI would be ignored. Batch Insertion with Select: 1INSERT INTO orders_archived SELECT * FROM orders WHERE order_date &lt; ’2019-01-01’; Column attributes (constraints) like PK, AI would be ignored as well. Truncate Table in workbench: Right click a table and select ‘truncate table’ would remove all the data (records) but would not remove the table itself. Update a single row: 1UPDATE invoices SET payment_total = 10, payment_date=’2019-03-01’ WHERE invoice_id = 1; Filter the results (single line) that meet the conditions and update the filtered results. It is also allowed to use default, arithmetic expression, etc. as the new value of the selected row. Note that even if multiple statements are selected for your filter criteria, MySQL workbench runs in the security update mode by default, allowing you to update only one row at a time. However, in other environments, there is no such problem. You can drag it to the bottom of SQL editor and choose to uncheck the safe updates option. After changing the settings, you need to reconnect for the settings to take effect. WHERE attribute IN (1,2,3) can be used to filter multiple records. Use SELECT to UPDATE (apply sub-query in UPDATE): 1UPDATE invoices SET payment_total = 10, payment_date=’2019-03-01’ WHERE client_id = ( SELECT client_id FROM clients WHERE name=’Myworks’ ); In this manner, a single logical judgement is replaced with a sub-query to update multiple values at a time. If multiple values would be returned in your sub-query, the WHERE clause should be changed to WHERE client_id IN (sub-query). You should test the sub-query before update the table. You CANNOT update the same table where you conduct your sub-query —- If you have to do so, create a duplicate and give it an alias. DELETE:1DELETE FROM invoices WHERE (invoice_id=1); Obviously, the condition within the parenthesis can be a sub-query, too. Rebuild the Database:12DROP DB If EXISTS DB;-- Conduct the script of DB building then.","categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]},{"title":"SQL Study Note - 1 - Syntax Basics","slug":"SQL-Study-Note-1","date":"2022-04-16T21:05:53.000Z","updated":"2022-04-17T01:31:33.088Z","comments":true,"path":"2022/04/16/SQL-Study-Note-1/","link":"","permalink":"http://example.com/2022/04/16/SQL-Study-Note-1/","excerpt":"Overview The core of database system is to interact with DB (DataBase) with DBMS (Database Management System).","text":"Overview The core of database system is to interact with DB (DataBase) with DBMS (Database Management System). The DB can be generally divided into: Relational DB NoSQL DB (e.g., KV (key-value) based DB) Recommended code style of SQL (Structed Query Language): Capitalize all keywords and reserved words, and lowercase all other contents. Each statement should end with ;. Keywords and Syntax RulesThe query syntax SHOW DATABASES 1SHOW DATABASES; List all the names of exisitng databases (under the current schema). USE 1234USE database_name;SELECT * from table;SELECT * from database_name.table; -- Must specify the database_name for the DBs which are not in use Select one DB as the default one. SELECT 1SELECT (column_name) FROM (table_name) WHERE (condition) ORDER BY (col_name). Select the desired data from a table. It should be noted that you should use &#x3D; in SQL to determine equivalence. (It DOES NOT mean assignment.) You can conduct calculation on the selected result. AS 1SELECT (column_name) FROM (table_name) WHERE (condition) ORDER BY (col_name). For each col_name, table_name to be queried and the queried results, you can always to set alias (surname) for them with AS. – &#x2F; comment 12-- This a comment.// This is also acceptable. DISTINCT 1SELECT DISTINCT column_name FROM t Add DISTINCT ahead of the queried target (column) to receive all the unique values. AND &#x2F; OR &#x2F; NOT 1SELECT * FROM t WHERE col_a &gt; 10 and col_b = &#x27;CA&#x27; Logical operator to be used with the WHERE clause. IN 1SELECT * FROM t WHERE col_a IN (&#x27;A&#x27;, &#x27;B&#x27;) Determine if the queried value belongs to a set. BETWEEN 123SELECT * FROM t WHERE point BETWEEN 100 AND 300;SELECT * FROM t WHERE point &gt;= 100 AND point &lt;= 300;-- These two are equivalent Determine if the queried value within a given interval. Both ends of the interval are closed ([beg, end]). LIKE12SELECT * FROM t WHERE name like &#x27;b%&#x27;-- Able to match &#x27;Bob&#x27; and &#x27;bike&#x27; Provide functionality similar to Regular Expression. % can match arbitrary string, _ can match arbitrary char. Not sensitive to the case. REGEXP1SELECT * FROM t WHERE name REGEX &#x27;^f[a-z]+d&#x27; Match a given Regular Expression pattern. IS NULL12SELECT * FROM t WHERE name IS NULL;SELECT * FROM t WHERE name IS NOT NULL; Query all the records which are (not) null in a given column. ORDER BY1SELECT * FROM t ORDER BY col_name DESC / AESC Decide the sorting order of the returned records. LIMIT12SELECT * FROM t LIMIT offset, tot_numSELECT * FROM t LIMIT tot_num Restrict the number of the returned records. Skip the first $n&#x3D;$offset records and then return tot_num lines of records. Return all the records if number of matched records fewer than tot_num. INNER JOIN123SELECT * FROM t_a JOIN t_b on t_a.col_1 = t_b.col_2;SELECT * FROM t_a JOIN t_b on t_a.col_1 = DB_2.t_b.col_2;-- You can conduct crossed-DB join by specifying the name of the DB not in use. Can be simply writtene as JOIN. Concat two tables based on the given condition. Conduct Cartesian product implicitly. SELF JOIN1SELECT * FROM t_a AS a JOIN t_a AS b on a.col_1 = b.col_2; A table can join with itself, but different alias are required. Multi-table JOIN1SELECT * FROM t_a JOIN t_b on a.col_1 = b.col_2 JOIN t_c on b.col_2 = c.col_3; Multiple (n) tables can be joined but this is not recommended when $ n &gt; 3 $ due to performance concern. Composite JOIN &#x2F; Implicit JOIN1SELECT * FROM t_a JOIN t_b on a.col_1 = b.col_2 JOIN t_c on b.col_2 = c.col_3; Sometimes only a tuple of multiple attributes can uniquely identify a row of the table. In this case, these attributes become Composite Primary Key. 1SELECT * FROM t_a, t_b; Implicit JOIN is conducted in the above example but this is not recommended, too. OUTER JOIN1SELECT * FROM t_a AS a JOIN t_b AS b on a.col_1 = b.col_2 JOIN t_c AS c on b.col_2 = c.col_3; When using INNER JOIN, some records of the left table cannot match with the right table because the condition of the ON clause is not satisfied. However, if we want to return all the records of the left (right) table regardless of the boolean value of the ON clause, we can use LEFT (RIGHT) OUTER JOIN. You should use RIGHT JOIN instead of LEFT JOIN as possible. SELF OUTER JOIN is similar, and alias is still required. USING123SELECT * FROM t_a JOIN t_b on t_a.col_1 = t_b.col_1;SELECT * FROM t_a JOIN t_b USING (col_1);-- These two are equivalent. Can be used to simplify the code, if the column names of the to-be-joined tables are exactly the same. You can Join on a tuple like ‘USING (id1, id2, id3)’ and these column names should be exactly the same as well (in the two tables). NATURAL JOIN1SELECT * FROM t_a NATURAL JOIN t_b; Let the compiler (DBMS) to decide the way of join. Not recommended to use! CROSS JOIN1SELECT * FROM t_a CROSS JOIN t_b; Conduct Cartesian Product. UNION1SELECT * FROM a UNION SELECT * FROM b; Concatenate multiple queried results together (on the direction of row). The column names should be exactly the same. IT SHOULD BE NOTED that ORDER BY can be set only once, so union all the results before setting the ORDER clause.","categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]}],"categories":[{"name":"Data Science","slug":"Data-Science","permalink":"http://example.com/categories/Data-Science/"},{"name":"SQL","slug":"Data-Science/SQL","permalink":"http://example.com/categories/Data-Science/SQL/"},{"name":"Job Search","slug":"Job-Search","permalink":"http://example.com/categories/Job-Search/"},{"name":"SQL","slug":"Job-Search/SQL","permalink":"http://example.com/categories/Job-Search/SQL/"}],"tags":[{"name":"SQL","slug":"SQL","permalink":"http://example.com/tags/SQL/"},{"name":"DataScience","slug":"DataScience","permalink":"http://example.com/tags/DataScience/"}]}